ERP.belugaerp/src/InformationRegisters/ПорядокОтраженияНаСчетахУчета/ПорядокОтраженияНаСчетахУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорядокОтраженияНаСчетахУчета</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СчетУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ВидСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>АналитикаУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/ВариантыРаспределенияРасходов/ВариантыРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыРаспределенияРасходов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НаВнеоборотныеАктивы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НаНаправленияДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НаОбъектыВозникновенияЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НаПроизводственныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НаРасходыБудущихПериодов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НаСебестоимостьПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НаСебестоимостьПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НаСебестоимостьТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеРаспределять</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ТТНВходящаяЕГАИС/ТТНВходящаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТТНВходящаяЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_СоставУпаковок</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДоверительнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаТТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перенаправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатусПроверкиИПодбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварВПутиПринадлежитГрузополучателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упакована</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>бг_УпаковкаПаллета</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_ФактическаяКрепость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерСправки2Поставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>17</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Шаг</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрузоотправительКод</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрузополучательКод</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТТН</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/CommonModules/бг_ПриобретениеТоваровУслугИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства);
	ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства);
					
КонецПроцедуры

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_ОбработчикиСобытийСтандартный, адаптер_РаботаСДаннымиИБ;
	адаптер_ОбработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_ОбработчикиСобытийСтандартный");
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	ДанныеОбъекта = адаптер_обработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения);
	
	РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];
	
	Если РеквизитыОбъекта.Свойство("ИдентификаторПоступления") И ЗначениеЗаполнено(РеквизитыОбъекта.ИдентификаторПоступления) Тогда 
		РеквизитыОбъекта.бг_ДокументПоступленияНаСклад.Вставить("ХозяйственнаяОперацияСтрока", ПолучитьЗначениеХозяйственнаяОперацияСтрока(РеквизитыОбъекта.ИдентификаторПоступления));
		РеквизитыОбъекта.ИдентификаторПоступления = Строка(РеквизитыОбъекта.ИдентификаторПоступления.УникальныйИдентификатор());
	КонецЕсли;
	
	Для каждого СтрокаТовары Из РеквизитыОбъекта.Товары Цикл
		
		Если СтрокаТовары.НаРасходыБудущихПериодов Тогда
			СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.СтатьяРасходов.Идентификатор));
			СчетаУчета = Новый Массив;
			СчетаУчета.Добавить("Расходы");
			СтруктураЗначенийСчетаУчета = РегистрыСведений.ПорядокОтраженияНаСчетахУчета.СтруктураЗначенийПоАналитикеУчета(СтатьяРасходов, СчетаУчета);
			ПравилоРаспределения        = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяРасходов,"ПравилоРаспределенияРасходовРегл");
			НоваяСтатья                 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоРаспределения,"СтатьяСписанияРБП");
			адаптер_РаботаСДаннымиИБ.ЗаполнитьЗначениеРеквизита(СтрокаТовары,"СтатьяРасходов_ЗначениеРеквизитаИдентификатор",НоваяСтатья,Новый ТаблицаЗначений);
			СтрокаТовары.СтатьяРасходов.Вставить("Код", НоваяСтатья.Код);
			адаптер_РаботаСДаннымиИБ.ЗаполнитьЗначениеРеквизита(СтрокаТовары,"СчетУчета_ЗначениеРеквизитаИдентификатор",СтруктураЗначенийСчетаУчета.СчетУчета_Расходы,Новый ТаблицаЗначений);
			СтрокаТовары.СчетУчета.Вставить("Код", СтруктураЗначенийСчетаУчета.СчетУчета_Расходы.Код);
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыОбъекта.Вставить("ОтражатьСкладскиеДвижения", бг_ИнтеграцияЕГАИС.ОтражатьСкладскиеДвиженияПоОснованию(Объект));
	РеквизитыОбъекта.Вставить("ТТНВходящаяПодтвержденаЕГАИС", ТТНВходящаяПодтвержденаЕГАИС(Объект));
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт
	
	ТекстПоиска =
	"NULL КАК СчетУчета_ЗначениеРеквизитаКод";
	
	ТекстЗамены =
	""""" КАК СчетУчета_ЗначениеРеквизитаКод";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
	
	ТекстПоиска =
	"NULL КАК НаРасходыБудущихПериодов";
	
	ТекстЗамены =
	"ЕстьNULL(ВыгружаемыйОбъект.Товары.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов),Ложь) КАК НаРасходыБудущихПериодов";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
	
	// Подстаноавка выгрузки типа номенклатуры в ТЧ "Товары".
	ТекстПоиска = "NULL КАК ТипНоменклатуры_ЗначениеРеквизитаЗначениеПеречисления";
	ТекстЗамены = "ЕстьNULL(ВыгружаемыйОбъект.Товары.Номенклатура.ТипНоменклатуры, Значение(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) КАК ТипНоменклатуры_ЗначениеРеквизитаЗначениеПеречисления";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
	
	// Подстаноавка выгрузки ИдентификаторПоступления.
	ТекстПоиска = "NULL КАК ИдентификаторПоступления";
	ТекстЗамены = "ВыгружаемыйОбъект.бг_ДокументПоступленияНаСклад КАК ИдентификаторПоступления";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);

КонецПроцедуры

Функция ПолучитьКлючМаршрутизацииИсходящегоСообщения(ДанныеСообщения, ИсточникОбъект = Неопределено) Экспорт
	
	Перем адаптер_ОбработчикиСобытийСтандартный;
	адаптер_ОбработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_ОбработчикиСобытийСтандартный");
	
	КлючМаршрутизации = адаптер_ОбработчикиСобытийСтандартный.ПолучитьКлючМаршрутизацииИсходящегоСообщения(ДанныеСообщения);
	
	Если ИсточникОбъект <> Неопределено И ИсточникОбъект.бг_ПриобретениеТОиР = Истина Тогда  
		
		МассивТоваров = ИсточникОбъект.Товары.ВыгрузитьКолонку("Номенклатура");
		ВидыНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивТоваров, "ВидНоменклатуры");
		ВидыНоменклатурыТОиР = бг_КонстантыПовтИсп.ЗначенияКонстант(
			"ВидНоменклатурыЗапчастиТОиР, ВидНоменклатурыИнструментТОиР,"
			+ "ВидНоменклатурыГСМТОиР, ВидНоменклатурыМатериалыРасходныеТОиР");
		
		Для каждого КлючЗначение Из ВидыНоменклатуры Цикл
			
			Если Не (КлючЗначение.Значение = ВидыНоменклатурыТОиР.ВидНоменклатурыЗапчастиТОиР
				Или КлючЗначение.Значение = ВидыНоменклатурыТОиР.ВидНоменклатурыИнструментТОиР 
				Или КлючЗначение.Значение = ВидыНоменклатурыТОиР.ВидНоменклатурыГСМТОиР 
				Или КлючЗначение.Значение = ВидыНоменклатурыТОиР.ВидНоменклатурыМатериалыРасходныеТОиР) Тогда 
				ТекстОшибки = НСтр("ru='В документе установлен признак ""Приоретение по ТОиР"", в"
					+ " этом случае товары должны быть загружены из ТОиР'");
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
		КонецЦикла;
		
		КлючМаршрутизации = КлючМаршрутизации + ".ТОиР";
	
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСообщения.Объект, "бг_ПриобретениеТОиР") = Истина Тогда

		КлючМаршрутизации = КлючМаршрутизации + ".ТОиР";
		
	КонецЕсли;
	
	Возврат КлючМаршрутизации;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьКлючевыеПоляПервичногоДокумента(РеквизитыИСвойства) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	ДлинаСтроки30 = 30;
	ДлинаСтроки50 = 50;
	ОписаниеТипаСтрока30 = ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки30);
	ОписаниеТипаСтрока50 = ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки50);

	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Документы.ПервичныйДокумент,
		"Дата", , 
		ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Документы.ПервичныйДокумент,
		"Номер", , 
		ОписаниеТипаСтрока30);
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Документы.ПервичныйДокумент,
		"ДатаВходящегоДокумента", , 
		ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Документы.ПервичныйДокумент,
		"НомерВходящегоДокумента", , 
		ОписаниеТипаСтрока50);
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Документы.ПервичныйДокумент,
		"ТипПервичногоДокумента", , 
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыПервичныхДокументов"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначениеХозяйственнаяОперацияСтрока(ДокументПоступленияНаСклад)
	
	ХозяйственнаяОперацияСтрока = ОбщегоНазначения.ИмяЗначенияПеречисления((ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступленияНаСклад, "ХозяйственнаяОперация")));
	
	Возврат ХозяйственнаяОперацияСтрока; 
	
КонецФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	// Шапка
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // МетаданныеОбъекта
		"ОтражатьСкладскиеДвижения",
		Новый ОписаниеТипов("Булево"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // МетаданныеОбъекта
		"ТТНВходящаяПодтвержденаЕГАИС",
		Новый ОписаниеТипов("Булево"));
		
	// Товары
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // МетаданныеОбъекта
		"Товары.СчетУчета",
		Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // МетаданныеОбъекта
		"Товары.НаРасходыБудущихПериодов",
		Новый ОписаниеТипов("Булево"));
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // МетаданныеОбъекта
		"ИдентификаторПоступления",
		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		, // МетаданныеОбъекта
		"Товары.ТипНоменклатуры",
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
				
КонецПроцедуры

Процедура ДобавитьКлючевыеПоляКВыгрузке(РеквизитыИСвойства)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.НомераГТД,
		"Код",
		, // МетаданныеОбъекта
		ОбщегоНазначения.ОписаниеТипаСтрока(30));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.НомераГТД,
		"РегистрационныйНомер",
		, // МетаданныеОбъекта
		ОбщегоНазначения.ОписаниеТипаСтрока(29));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.НомераГТД,
		"СтранаПроисхождения",
		, // МетаданныеОбъекта
		Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.СтраныМира,
		"Наименование",
		, // МетаданныеОбъекта
		ОбщегоНазначения.ОписаниеТипаСтрока(60));
				
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.Назначения,
		"Договор",
		, // МетаданныеОбъекта
		Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));		

	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.ДоговорыКонтрагентов,
		"ТипДоговора",
		, // МетаданныеОбъекта
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДоговоров"));		

		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.ДоговорыКонтрагентов,
		"Контрагент",
		, // МетаданныеОбъекта
		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));		
		
    адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.ДоговорыКонтрагентов,
		"ВалютаВзаиморасчетов",
		, // МетаданныеОбъекта
		Новый ОписаниеТипов("СправочникСсылка.Валюты"));		
		
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.ДоговорыКонтрагентов,
		"ОплатаВВалюте",
		, // МетаданныеОбъекта
		Новый ОписаниеТипов("Булево"));		
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		Метаданные.Справочники.ОбъектыРасчетов,
		"Объект", , 
		Метаданные.ОпределяемыеТипы.ОбъектРасчетов.Тип);
	
	ДобавитьКлючевыеПоляПервичногоДокумента(РеквизитыИСвойства);
	
КонецПроцедуры

Функция ТТНВходящаяПодтвержденаЕГАИС(ПриобретениеТоваровИУслуг)
	
	ДанныеТТНВходящей = Документы.ТТНВходящаяЕГАИС.бг_ДанныеТТНВходящейПоСвязанномуДокументу(
		ПриобретениеТоваровИУслуг,
		Истина);
	
	ТТНВходящаяПодтвержденаЕГАИС = Ложь;
	
	Если ДанныеТТНВходящей <> Неопределено Тогда
		
		ТТНВходящаяПодтвержденаЕГАИС = Документы.ТТНВходящаяЕГАИС.бг_СтатусЯвляетсяПодтвержденным(
			ДанныеТТНВходящей.ТекущийСтатус);
			
	КонецЕсли;
	
	Возврат ТТНВходящаяПодтвержденаЕГАИС;
	
КонецФункции

#КонецОбласти
